{
  "magic": "E!vIA5L86J2I",
  "timestamp": "2025-02-09T00:55:44.476106+00:00",
  "repo": "ietf-rats-wg/draft-ietf-rats-posture-assessment",
  "labels": [
    {
      "name": "bug",
      "description": "Something isn't working",
      "color": "d73a4a"
    },
    {
      "name": "documentation",
      "description": "Improvements or additions to documentation",
      "color": "0075ca"
    },
    {
      "name": "duplicate",
      "description": "This issue or pull request already exists",
      "color": "cfd3d7"
    },
    {
      "name": "enhancement",
      "description": "New feature or request",
      "color": "a2eeef"
    },
    {
      "name": "good first issue",
      "description": "Good for newcomers",
      "color": "7057ff"
    },
    {
      "name": "help wanted",
      "description": "Extra attention is needed",
      "color": "008672"
    },
    {
      "name": "invalid",
      "description": "This doesn't seem right",
      "color": "e4e669"
    },
    {
      "name": "question",
      "description": "Further information is requested",
      "color": "d876e3"
    },
    {
      "name": "wontfix",
      "description": "This will not be worked on",
      "color": "ffffff"
    }
  ],
  "issues": [
    {
      "number": 1,
      "id": "I_kwDONMUyhM6h0GOp",
      "title": "Editorial",
      "url": "https://github.com/ietf-rats-wg/draft-ietf-rats-posture-assessment/issues/1",
      "state": "OPEN",
      "author": "PieterKas",
      "authorAssociation": "NONE",
      "assignees": [],
      "labels": [],
      "body": "Section 3:\r\n\r\nunder stand -> understand",
      "createdAt": "2024-12-03T11:44:28Z",
      "updatedAt": "2024-12-03T11:44:28Z",
      "closedAt": null,
      "comments": []
    },
    {
      "number": 2,
      "id": "I_kwDONMUyhM6h0KX8",
      "title": "Add preference for CIS Container benchmarks",
      "url": "https://github.com/ietf-rats-wg/draft-ietf-rats-posture-assessment/issues/2",
      "state": "OPEN",
      "author": "PieterKas",
      "authorAssociation": "NONE",
      "assignees": [],
      "labels": [],
      "body": "Is there a reference that can be added for the CIS container security benchmarks? (e.g. https://www.cisecurity.org/benchmark/docker?utm_source=chatgpt.com, https://www.cisecurity.org/benchmark/kubernetes?utm_source=chatgpt.com)",
      "createdAt": "2024-12-03T11:50:48Z",
      "updatedAt": "2024-12-03T14:14:50Z",
      "closedAt": null,
      "comments": [
        {
          "author": "KME",
          "authorAssociation": "COLLABORATOR",
          "body": "Yes, thanks. We need to add in references!",
          "createdAt": "2024-12-03T14:14:48Z",
          "updatedAt": "2024-12-03T14:14:48Z"
        }
      ]
    },
    {
      "number": 3,
      "id": "I_kwDONMUyhM6h0Mnz",
      "title": "Claims for Container Security Benchmarks",
      "url": "https://github.com/ietf-rats-wg/draft-ietf-rats-posture-assessment/issues/3",
      "state": "OPEN",
      "author": "PieterKas",
      "authorAssociation": "NONE",
      "assignees": [],
      "labels": [],
      "body": "Will this specification define claim values based on container security benchmarks, or is the expectation that those values are defined in the MPS registry?",
      "createdAt": "2024-12-03T11:54:46Z",
      "updatedAt": "2024-12-03T14:14:13Z",
      "closedAt": null,
      "comments": [
        {
          "author": "KME",
          "authorAssociation": "COLLABORATOR",
          "body": "The expectation is that those would be in the registry. The reason being is that if you look at what was needed for the TCG Reference Integrity Metrics, each vendor used that single policy and their defined \"Golden values\" varied. The reason is that firmware was different for each vendor based on their implementation. They may have varied underlying hardware and they may update versions over time. The types of information checked for each would be the same with variances in the configuration settings and measurements.",
          "createdAt": "2024-12-03T14:14:12Z",
          "updatedAt": "2024-12-03T14:14:12Z"
        }
      ]
    },
    {
      "number": 4,
      "id": "I_kwDONMUyhM6h0Rhe",
      "title": "Multiple Benchmarks",
      "url": "https://github.com/ietf-rats-wg/draft-ietf-rats-posture-assessment/issues/4",
      "state": "OPEN",
      "author": "PieterKas",
      "authorAssociation": "NONE",
      "assignees": [],
      "labels": [],
      "body": "Is the expectation that multiple benchmarks will be included in a single MPS, or will there be multiple MPS claims, each with their benchmark (e.g. an array of MPS claims).",
      "createdAt": "2024-12-03T12:03:05Z",
      "updatedAt": "2024-12-03T14:09:49Z",
      "closedAt": null,
      "comments": [
        {
          "author": "KME",
          "authorAssociation": "COLLABORATOR",
          "body": "The CIS Benchmarks and DISA STIGS would be quite large to combine. The current intention is to have an MPS represent a single Benchmark and potentially portions of a Benchmark if it makes more sense for some to be broken up into sections to test and complete comparison verifications.",
          "createdAt": "2024-12-03T14:09:36Z",
          "updatedAt": "2024-12-03T14:09:49Z"
        }
      ]
    },
    {
      "number": 5,
      "id": "I_kwDONMUyhM6njs0A",
      "title": "Some thoughts about Intro - v1",
      "url": "https://github.com/ietf-rats-wg/draft-ietf-rats-posture-assessment/issues/5",
      "state": "OPEN",
      "author": "muhammad-usama-sardar",
      "authorAssociation": "NONE",
      "assignees": [],
      "labels": [],
      "body": "### General thoughts\nIn general, the problem statement is not yet clear to me. I think a figure in Sec. 1 and defining some terms in Sec. 2 would help. \n\nIn the scope of this document, I would like to understand:\n\n- What is the need/motivation for attestation?\n- Who is attesting to whom? \n- Is it local attestation or remote attestation? \n- Compliance is mentioned multiple times in the draft, and I believe there is no \"global\" compliance; compliance is with reference to a specific regulation. It remains unclear to me which regulation is intended. \n- I am specifically concerned about protocols. Where in this whole assessment process do the protocols get checked? \n\n### Specific questions\nNote: Emphasis in the quoted text is my own \n\n> By using **policy** and **measurement sets** that may be offered at various assurance levels, **local assessment of evidence** can be performed to continuously assess **compliance**.\n\n- Which policy is this related to: policy for Evidence or Attestation Results? \n- measurement sets: are these Claims or Reference Values? If the former, does it include runtime measurements or just loadtime measurements?\n- local assessment of evidence: is the draft about local attestation or remote attestation?\n- compliance: compliance with what?\n\n> this kind of **compliance**\n\ncompliance with what?\n\n> The **local** system or server host performs the assessment of posture and remediation.\n\nSeems local attestation to me, I am not sure why remote attestation is mentioned in the draft. \n\n> This document describes a method to use existing remote attestation formats and **protocols**.\n\nThis was very interesting for me. But unfortunately, there is no other mention of protocols in the rest of the document. ",
      "createdAt": "2025-01-25T20:03:35Z",
      "updatedAt": "2025-01-28T05:58:29Z",
      "closedAt": null,
      "comments": [
        {
          "author": "KME",
          "authorAssociation": "COLLABORATOR",
          "body": "Usama,\n\nThank you for your thoughtful questions!\n\nyou are correct that there are 2 levels of attestation, local to assess policy and then an attestation that is remote to convey a set of results against a defined policy or configuration level. Today, this activity happens, but it does not scale and requires lots of resources. This is the same problem the Huawei proposal is trying to solve, but theirs is with a different architectural pattern. This pattern also considers scale, but factors in transparency required by auditors.\n\nThis is setting a general capability with a registry to allow for any defined policy or regulation to be attested using evidence and verification of evidence. Then for the remote attestation, the evidence is assessed to see if all of the conditions are met to fulfill the compliance requirements, verifying sets of local attestations, then attesting to the result. Conveying the smaller result in a way that can be understood due to the registry and defined expectations allows for a small message to be sent. It is not efficient to perform full assessments to a large policy on the wire for a data center with thousands of systems. Huawei approaches this by sending one result for many systems. This posture assessment draft instead sends a small message that links back to the local attestation evidence providing a transparent trail of evidence required for audits to meet both requirements.\n\nWhich protocols? Are you asking because of TLS Attestation?\n\nFor your question on measurements, yes, we will want to test both at load time and at runtime.\n\nI hope this clarifies further and I'm happy to get on a call if helpful.",
          "createdAt": "2025-01-27T17:18:55Z",
          "updatedAt": "2025-01-27T17:18:55Z"
        },
        {
          "author": "aj-stein",
          "authorAssociation": "COLLABORATOR",
          "body": "Re @muhammad-usama-sardar's framing questions and specific questions, perhaps we can make some incremental edits and send them to him and the list for review and consideration to ensure we better answer those questions, @KME? We can work on that together if you'd like.",
          "createdAt": "2025-01-28T05:58:28Z",
          "updatedAt": "2025-01-28T05:58:28Z"
        }
      ]
    }
  ],
  "pulls": []
}